app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1) LIMIT 1
---
  def deliver
   # Delayed::Job.enqueue(MailingJob.new(params[:id]))
    @task = Task.find_by_id(params[:id].to_i)